RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_exmc.h
/* SDRAM */
/* EXMC_SDCTLx,x=0..1 */
#define EXMC_SDCTL_CAW                    BITS(0,1)                     /*!< column address bit width */
#define EXMC_SDCTL_RAW                    BITS(2,3)                     /*!< row address bit width */
#define EXMC_SDCTL_SDW                    BITS(4,5)                     /*!< SDRAM data bus width */
#define EXMC_SDCTL_NBK                    BIT(6)                        /*!< number of banks */
#define EXMC_SDCTL_CL                     BIT(7,8)                      /*!< CAS Latency */
#define EXMC_SDCTL_WPEN                   BIT(9)                        /*!< write protection enable */
#define EXMC_SDCTL_SDCLK                  BITS(10,11)                   /*!< SDRAM clock configuration */
#define EXMC_SDCTL_BRSTRD                 BIT(12)                       /*!< burst read */
#define EXMC_SDCTL_PIPED                  BITS(13,14)                   /*!< pipeline delay */

/* EXMC_SDTCFGx,x=0..1 */
#define EXMC_SDTCFG_LMRD                  BITS(0,3)                     /*!< load mode register delay */
#define EXMC_SDTCFG_XSRD                  BITS(4,7)                     /*!< exit self-refresh delay */
#define EXMC_SDTCFG_RASD                  BITS(8,11)                    /*!< row address select delay */
#define EXMC_SDTCFG_ARFD                  BITS(12,15)                   /*!< auto refresh delay */
#define EXMC_SDTCFG_WRD                   BITS(16,19)                   /*!< write recovery delay */
#define EXMC_SDTCFG_RPD                   BITS(20,23)                   /*!< row precharge delay */
#define EXMC_SDTCFG_RCD                   BITS(24,27)                   /*!< row to column delay */

/* EXMC_SDCMD */
#define EXMC_SDCMD_CMD                    BITS(0,2)                     /*!< command */
#define EXMC_SDCMD_DS1                    BIT(3)                        /*!< device select 1 */
#define EXMC_SDCMD_DS0                    BIT(4)                        /*!< device select 0 */
#define EXMC_SDCMD_NARF                   BITS(5,8)                     /*!< number of successive auto-refresh */
#define EXMC_SDCMD_MRC                    BITS(9,21)                    /*!< mode register content */

/* EXMC_SDARI */
#define EXMC_SDARI_REC                    BIT(0)                        /*!< refresh error flag clear */
#define EXMC_SDARI_ARINTV                 BITS(1,13)                    /*!< auto-refresh interval */
#define EXMC_SDARI_REIE                   BIT(14)                       /*!< interrupt refresh error enable */

/* EXMC_SDSTAT */
#define EXMC_SDSDAT_REIF                  BIT(0)                        /*!< refresh error interrupt flag */
#define EXMC_SDSDAT_STA0                  BITS(1,2)                     /*!< device 0 status */
#define EXMC_SDSDAT_STA1                  BITS(3,4)                     /*!< device 1 status */
#define EXMC_SDSDAT_NRDY                  BIT(5)                        /*!< not ready status */

/* EXMC_SDRSCTL */
#define EXMC_SDRSCTL_RSEN                 BIT(0)                        /*!< read sample enable */
#define EXMC_SDRSCTL_SSCR                 BIT(1)                        /*!< select sample cycle of read data */
#define EXMC_SDRSCTL_SDSC                 BITS(4,7)                     /*!< select the delayed sample clock of read data */

/* SQPI PSRAM */
/* EXMC_SINIT */
#define EXMC_SINIT_CMDBIT                 BITS(16,17)                   /*!< bit number of SPI PSRAM command phase */
#define EXMC_SINIT_ARDBIT                 BITS(24,28)                   /*!< bit number of SPI PSRAM address phase */
#define EXMC_SINIT_IDL                    BITS(29,30)                   /*!< SPI PSRAM ID length */
#define EXMC_SINIT_POL                    BIT(31)                       /*!< read data sample polarity */

/* EXMC_SRCMD */
#define EXMC_SRCMD_RCMD                   BITS(0,15)                    /*!< SPI read command for AHB read transfer */
#define EXMC_SRCMD_RWAITCYCLE             BITS(16,19)                   /*!< SPI read wait cycle number after address phase */
#define EXMC_SRCMD_RMODE                  BITS(20,21)                   /*!< SPI PSRAM read command mode */
#define EXMC_SRCMD_RDID                   BIT(31)                       /*!< send SPI read ID command */

/* EXMC_SWCMD */
#define EXMC_SWCMD_WCMD                   BITS(0,15)                    /*!< SPI write command for AHB write transfer */
#define EXMC_SWCMD_WWAITCYCLE             BITS(16,19)                   /*!< SPI write wait cycle number after address phase */
#define EXMC_SWCMD_WMODE                  BITS(20,21)                   /*!< SPI PSRAM write command mode */
#define EXMC_SWCMD_SC                     BIT(31)                       /*!< send SPI special command */

/* EXMC_SIDL */
#define EXMC_SIDL_SIDL                    BITS(0,31)                    /*!< ID low data saved for SPI read ID command */

/* EXMC_SIDH */
#define EXMC_SIDL_SIDH                    BITS(0,31)                    /*!< ID high Data saved for SPI read ID command */

/* constants definitions */
/* EXMC NOR/SRAM timing initialize structure */
typedef struct
{
    uint32_t asyn_access_mode;                                          /*!< asynchronous access mode */

    uint32_t syn_data_latency;                                          /*!< configure the data latency */
                                                                        /*!< the range is EXMC_DATALAT_2_CLK to EXMC_DATALAT_17_CLK */

    uint32_t syn_clk_division;                                          /*!< configure the clock divide ratio */
                                                                        /*!< the range is EXMC_SYN_CLOCK_RATIO_2_CLK to EXMC_SYN_CLOCK_RATIO_16_CLK */

    uint32_t bus_latency;                                               /*!< configure the bus latency */
                                                                        /*!< the range is 1 to 16 HCLK */

    uint32_t asyn_data_setuptime;                                       /*!< configure the data setup time,asynchronous access mode valid */
                                                                        /*!< the range is 2 to 256 HCLK */

    uint32_t asyn_address_holdtime;                                     /*!< configure the address hold time,asynchronous access mode valid */
                                                                        /*!< the range is 2 to 16 HCLK */

    uint32_t asyn_address_setuptime;                                    /*!< configure the data setup time,asynchronous access mode valid */
                                                                        /*!< the range is 1 to 16 HCLK */
}exmc_norsram_timing_parameter_struct;

/* EXMC NOR/SRAM initialize structure */
typedef struct
{
    uint32_t norsram_region;                                            /*!< select the region of EXMC NOR/SRAM bank */
                                                                        /*!< norsram_region: EXMC_BANK0_NORSRAM_REGIONx,x=0..3 */

