RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_exmc.h
    uint32_t write_mode;                                                /*!< the write mode, synchronous mode or asynchronous mode */
                                                                        /*!< write_mode: EXMC_ASYN_WRITE or EXMC_SYN_WRITE */

    uint32_t extended_mode;                                             /*!< enable or disable the extended mode */
                                                                        /*!< extended_mode: ENABLE or DISABLE */

    uint32_t asyn_wait;                                                 /*!< enable or disable the asynchronous wait function */
                                                                        /*!< asyn_wait: ENABLE or DISABLE */

    uint32_t nwait_signal;                                              /*!< enable or disable the NWAIT signal while in synchronous bust mode */
                                                                        /*!< nwait_signal: ENABLE or DISABLE */

    uint32_t memory_write;                                              /*!< enable or disable the write operation */
                                                                        /*!< memory_write: ENABLE or DISABLE */

    uint32_t nwait_config;                                              /*!< NWAIT signal configuration */
                                                                        /*!< nwait_config: EXMC_NWAIT_CONFIG_BEFORE or EXMC_NWAIT_CONFIG_DURING */

    uint32_t wrap_burst_mode;                                           /*!< enable or disable the wrap burst mode */
                                                                        /*!< wrap_burst_mode: ENABLE or DISABLE */

    uint32_t nwait_polarity;                                            /*!< specifies the polarity of NWAIT signal from memory */
                                                                        /*!< nwait_polarity: EXMC_NWAIT_POLARITY_LOW or EXMC_NWAIT_POLARITY_HIGH */

    uint32_t burst_mode;                                                /*!< enable or disable the burst mode */
                                                                        /*!< burst_mode: ENABLE or DISABLE */

    uint32_t databus_width;                                             /*!< specifies the databus width of external memory */
                                                                        /*!< databus_width: EXMC_NOR_DATABUS_WIDTH_8B or EXMC_NOR_DATABUS_WIDTH_16B */

    uint32_t memory_type;                                               /*!< specifies the type of external memory */
                                                                        /*!< memory_type: EXMC_MEMORY_TYPE_SRAM / EXMC_MEMORY_TYPE_PSRAM / EXMC_MEMORY_TYPE_NOR */

    uint32_t address_data_mux;                                          /*!< specifies whether the data bus and address bus are multiplexed */
                                                                        /*!< address_data_mux: ENABLE or DISABLE */

    exmc_norsram_timing_parameter_struct* read_write_timing;            /*!< timing parameters for read and write if the extendedmode is not used or the timing
                                                                             parameters for read if the extendedmode is used. */

    exmc_norsram_timing_parameter_struct* write_timing;                 /*!< timing parameters for write when the extendedmode is used. */
}exmc_norsram_parameter_struct;

/* EXMC NAND/PC card timing initialize struct */
typedef struct
{
    uint32_t databus_hiztime;                                           /*!< configure the dadtabus HiZ time for write operation */
                                                                        /*!< the range is 1 to 256 HCLK */

    uint32_t holdtime;                                                  /*!< configure the address hold time(or the data hold time for write operation) */
                                                                        /*!< the range is 1 to 255 HCLK */

    uint32_t waittime;                                                  /*!< configure the minimum wait time */
                                                                        /*!< the range is 2 to 256 HCLK (+NWAIT active cycles) */

    uint32_t setuptime;                                                 /*!< configure the address setup time */
                                                                        /*!< the range is 1 to 256 HCLK */
}exmc_nand_pccard_timing_parameter_struct;

/* EXMC NAND initialize structure */
typedef struct
{
    uint32_t nand_bank;                                                 /*!< select the bank of NAND */
                                                                        /*!< nand_bank: EXMC_BANK1_NAND or EXMC_BANK2_NAND */

    uint32_t ecc_size;                                                  /*!< the page size for the ECC calculation */
                                                                        /*!< ecc_size: EXMC_ECC_SIZE_xBYTES,x=256,512,1024,2048,4096 */

    uint32_t atr_latency;                                               /*!< configure the latency of ALE low to RB low */
                                                                        /*!< atr_latency: EXMC_ALE_RE_DELAY_x_HCLK,x=1..16 */

    uint32_t ctr_latency;                                               /*!< configure the latency of CLE low to RB low */
                                                                        /*!< ctr_latency: EXMC_CLE_RE_DELAY_x_HCLK,x=1..16 */

    uint32_t ecc_logic;                                                 /*!< enable or disable the ECC calculation logic */
                                                                        /*!< ecc_logic: ENABLE or DISABLE */

    uint32_t databus_width;                                             /*!< the NAND flash databus width */
                                                                        /*!< databus_width: EXMC_NAND_DATABUS_WIDTH_8B or EXMC_NAND_DATABUS_WIDTH_16B */

