RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Include/gd32f20x_exmc.h
    uint32_t wait_feature;                                              /*!< enables or disables the wait feature */
                                                                        /*!< wait_feature: ENABLE or DISABLE */

    exmc_nand_pccard_timing_parameter_struct* common_space_timing;      /*!< the timing parameters for NAND flash Common Space */

    exmc_nand_pccard_timing_parameter_struct* attribute_space_timing;   /*!< the timing parameters for NAND flash Attribute Space */
}exmc_nand_parameter_struct;

/* EXMC PC card initialize structure */
typedef struct
{
    uint32_t atr_latency;                                               /*!< configure the latency of ALE low to RB low */
                                                                        /*!< atr_latency: EXMC_ALE_RE_DELAY_x_HCLK,x=1..16 */

    uint32_t ctr_latency;                                               /*!< configure the latency of CLE low to RB low */
                                                                        /*!< ctr_latency: EXMC_CLE_RE_DELAY_x_HCLK,x=1..16 */

    uint32_t wait_feature;                                              /*!< enables or disables the Wait feature */
                                                                        /*!< wait_feature: ENABLE or DISABLE */

    exmc_nand_pccard_timing_parameter_struct*  common_space_timing;     /*!< the timing parameters for NAND flash Common Space */

    exmc_nand_pccard_timing_parameter_struct*  attribute_space_timing;  /*!< the timing parameters for NAND flash Attribute Space */

    exmc_nand_pccard_timing_parameter_struct*  io_space_timing;         /*!< the timing parameters for NAND flash IO Space */
}exmc_pccard_parameter_struct;;

/* EXMC SDRAM timing initialize structure */
typedef struct
{
    uint32_t row_to_column_delay;                                       /*!< configure the row to column delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t row_precharge_delay;                                       /*!< configure the row precharge delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t write_recovery_delay;                                      /*!< configure the write recovery delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t auto_refresh_delay;                                        /*!< configure the auto refresh delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t row_address_select_delay;                                  /*!< configure the row address select delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t exit_selfrefresh_delay;                                    /*!< configure the exit self-refresh delay */
                                                                        /*!< the range is 1 to 16 cycles */

    uint32_t load_mode_register_delay;                                  /*!< configure the load mode register delay */
                                                                        /*!< the range is 1 to 16 cycles */
}exmc_sdram_timing_parameter_struct;

/* EXMC SDRAM initialize structure */
typedef struct
{
    uint32_t sdram_device;                                              /*!< device of SDRAM */
                                                                        /*!< sdram_device: EXMC_SDRAM_DEVICE0 or EXMC_SDRAM_DEVICE1 */

    uint32_t pipeline_read_delay;                                       /*!< the delay for reading data after CAS latency in HCLK clock cycles */
                                                                        /*!< pipeline_read_delay: EXMC_PIPELINE_DELAY_x_HCLK, x=0..2 */

    uint32_t brust_read_switch;                                         /*!< enable or disable the burst read */
                                                                        /*!< brust_read_switch: ENABLE or DISABLE */

    uint32_t sdclock_config;                                            /*!< the SDCLK memory clock for both SDRAM banks */
                                                                        /*!< sdclock_config: EXMC_SDCLK_DISABLE,EXMC_SDCLK_PERIODS_2_HCLK,EXMC_SDCLK_PERIODS_3_HCLK */

    uint32_t write_protection;                                          /*!< enable or disable SDRAM bank write protection function */
                                                                        /*!< write_protection: ENABLE or DISABLE */

    uint32_t cas_latency;                                               /*!< configure the SDRAM CAS latency */
                                                                        /*!< cas_latency: EXMC_CAS_LATENCY_x_SDCLK, x=1..3 */

    uint32_t internal_bank_number;                                      /*!< the number internal banks */
                                                                        /*!< internal_bank_number: EXMC_SDRAM_2_INTER_BANK or EXMC_SDRAM_4_INTER_BANK */

    uint32_t data_width;                                                /*!< the databus width of SDRAM memory */
                                                                        /*!< data_width: EXMC_SDRAM_DATABUS_WIDTH_8B,EXMC_SDRAM_DATABUS_WIDTH_16B,EXMC_SDRAM_DATABUS_WIDTH_32B */

    uint32_t row_address_width;                                         /*!< the bit width of a row address */
                                                                        /*!< row_address_width: EXMC_SDRAM_ROW_ADDRESS_x, x=11..13 */

    uint32_t column_address_width;                                      /*!< the bit width of a column address */
                                                                        /*!< column_address_width: EXMC_SDRAM_COW_ADDRESS_x, x=8..11 */

